package com.tedu.sois.common.config;

/**
 * 全局状态码
 * @author LYS
 */
public interface StatusCodeConfig {

    /** 第一次保存 状态码*/
    int SAVE = 0;
    /** 修改信息 状态码*/
    int MODIFY = 1;

    /**姓名正则*/
    String REGEX_NAME = "^([\\u4e00-\\u9fa5]{1,20}|[a-zA-Z\\.\\s]{1,20})$";
    /**手机号码正则 2019-6*/
    String REGEX_PHONE_NUMBER = "^[1](([3|5|8][\\d])|([4][4,5,6,7,8,9])|([6][2,5,6,7])|([7][^9])|([9][1,8,9]))[\\d]{8}$";
    /**身份证号码正则*/
    String REGEX_ID_CARD = "(^[1-9]\\d{5}(18|19|20)\\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\\d{3}[0-9Xx]$)|" +
            "(^[1-9]\\d{5}\\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\\d{3}$)";
    /**特殊字符正则*/
    String REGEX_EX = "[`~!@#$%^&*()+=|{}':;',\\[\\].<>/?~！@#￥%……&*（）——+|{}【】‘；：”“’。，、？]";

    /** 学生部门号*/
    int STU_DEPT_CODE = 13;





}
